from enum import unique, Enum


@unique
class ProxyCityInfo(Enum):
    甘肃省张掖市 = (620000, 620700)
    甘肃省庆阳市 = (620000, 621000)
    陕西省商洛市 = (610000, 611000)
    云南省临沧市 = (530000, 530900)
    云南省玉溪市 = (530000, 530400)
    云南省丽江市 = (530000, 530700)
    云南省大理白族自治州 = (530000, 532900)
    云南省昭通市 = (530000, 530600)
    云南省文山壮族苗族自治州 = (530000, 532600)
    云南省普洱哈尼族彝族自治县 = (530000, 530821)
    云南省楚雄市 = (530000, 532301)
    云南省曲靖市 = (530000, 530300)
    云南省怒江傈僳族自治州 = (530000, 533300)
    云南省德宏傣族景颇族自治州 = (530000, 533100)
    云南省保山市 = (530000, 530500)
    四川省雅安市 = (510000, 511800)
    四川省自贡市 = (510000, 510300)
    四川省德阳市 = (510000, 510600)
    四川省眉山市 = (510000, 511400)
    四川省乐山市 = (510000, 511100)
    四川省泸州市市辖区 = (510000, 510501)
    广东省广州市 = (440000, 440100)
    广东省湛江市 = (440000, 440800)
    广东省珠海市 = (440000, 440400)
    湖南省益阳市 = (430000, 430900)
    湖北省十堰市 = (420000, 420300)
    河南省鹤壁市 = (410000, 410600)
    河南省焦作市 = (410000, 410800)
    山东省莱芜市 = (370000, 371200)
    山东省枣庄市 = (370000, 370400)
    山东省济南市 = (370000, 370100)
    山东省滨州市 = (370000, 371600)
    山东省威海市 = (370000, 371000)
    山东省潍坊市 = (370000, 370700)
    山东省泰安市 = (370000, 370900)
    山东省淄博市 = (370000, 370300)
    山东省日照市 = (370000, 371100)
    山东省烟台市 = (370000, 370600)
    江西省宜春市 = (360000, 360900)
    江西省新余市 = (360000, 360500)
    江西省分宜县 = (360000, 360521)
    江西省南昌市 = (360000, 360100)
    江西省萍乡市 = (360000, 360300)
    江西省赣州市 = (360000, 360700)
    江西省吉安市 = (360000, 360800)
    江西省九江市 = (360000, 360400)
    江西省上饶市 = (360000, 361100)
    江西省景德镇市 = (360000, 360200)
    江西省鹰潭市 = (360000, 360600)
    福建省南平市 = (350000, 350700)
    福建省厦门市 = (350000, 350200)
    福建省宁德市 = (350000, 350900)
    福建省漳州市 = (350000, 350600)
    福建省三明市 = (350000, 350400)
    安徽省池州市 = (340000, 341700)
    安徽省芜湖市 = (340000, 340200)
    安徽省合肥市 = (340000, 340100)
    安徽省马鞍山市 = (340000, 340500)
    安徽省宣城市 = (340000, 341800)
    安徽省六安市 = (340000, 341500)
    安徽省铜陵市 = (340000, 340700)
    安徽省蚌埠市 = (340000, 340300)
    安徽省黄山市 = (340000, 341000)
    安徽省亳州市 = (340000, 341600)
    安徽省阜阳市 = (340000, 341200)
    浙江省嘉兴市 = (330000, 330400)



class ProxyTime(Enum):
    Minute5_25 = 1,
    Minute25_240 = 2,
    Hour3_6 = 3,
    Hour6_12 = 4,
    Hour48_72 = 5


class ProxyYYS(Enum):
    # 未定义
    UnLimited = 0,
    # 中国联通
    联通 = 100026,
    # 中国电信
    电信 = 100027


class ProxyProtocol(Enum):
    HTTP = 1,
    SOCK5 = 2,
    HTTPS = 11


class ProxyIPType(Enum):
    IP_Dircet = 1,  # 直连IP
    IP_Tunnel = 2,  # 隧道IP
    IP_Debicated = 3  # 芝麻独享IP


class Proxy_supplier(Enum):
    ZHIMA = 1
    SOCKS5 = 2